app/controllers/store_controller.rb

  def index
  	@products = Product.where(:user =>(params[:user]=nil)).order(:name)
---
SELECT "products".* FROM "products" WHERE "products"."user" IS NULL ORDER BY name